Autodesk.Revit.DB.IFC.ImporterIFCUtils.UpdateDirectShapeCategory(Autodesk.Revit.DB.DirectShape,Autodesk.Revit.DB.ElementId)
Updates the category of a DirectShape.
Remarks:
Use this function carefully, as it could result in a mismatch between DirectShape
and DirectShapeType categories.
directShape:
The DirectShape.
newCategoryId:
The new category id.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.IFC.ImporterIFCUtils.GetLocalFileName(Autodesk.Revit.DB.Document,System.String)
Get the local file name, including the path, corresponding to a linked IFC file.
This will create a local copy of the IFC file if necessary.
aDoc:
The document that will contain the IFC link.
fileName:
The original file name and path.
Returns:
The local file name and path corresponding to the input file name.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Can't process file name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2018

Autodesk.Revit.DB.IFC.ImporterIFCUtils.CreateEmptyFamily(Autodesk.Revit.DB.IFC.ImporterIFC,Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,System.String)
Creates an empty family of a given category.
importerIFC:
The importer.
aDoc:
The document to create the family.
catId:
The category id.
familyName:
The family name.
Returns:
The created family id.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.IFC.ImporterIFCUtils
A class that contains utilities needed to implement Revit's version of the IFC import client application.
Remarks:
This class contains special API utilities needed to enable the implementation of the client application
for IFC import.  Some of these utilities will be needed temporarily while the code for IFC import is
migrated into the export client.  These temporary interfaces are likely to change in upcoming Revit
releases.
Since:
2014